app/Http/Controllers/PostController.php

select * from `tags`
select * from `lectures`
---
    public function tagSearch(Post $post, Lecture $lecture, Tag $tag, Request $request)
    {
        $tag_query = $request->query('tag');
        $lec_query = $request->query('lecture');
        if (is_null($tag_query) && is_null($lec_query)) {
            $posts = collect();
        }
        else {
            $posts = $post->getPaginateByLimitWithTagLectureId($tag_query, $lec_query);
            Carbon::setLocale('ja');
            foreach ($posts as $post) {
                // 各ポストの開始日時をフォーマット
                $post->start_at = Carbon::parse($post->start_at)->isoFormat('M月D日(dd) H:mm');

                // 各postに$participations配列を追加
                $post->participations = $this->num_participations($post);
            }
        }

        $lectures = $lecture->get();
        $lec_id_name = [];
        foreach($lectures as $lec) {
            $lec_id_name[] = ['id' => $lec->id, 'value' => $lec->name];
        }
        $tags = $tag->get();
        $tag_id_name = [];
        foreach($tags as $ta) {
            $tag_id_name[] = ['id' => $ta->id, 'value' => $ta->name];
        }
        return view('posts.tag-search')->with([
            'posts' => $posts,
            'lectures' => $lec_id_name,
            'tags' => $tag_id_name,
        ]);