app/Models/Post.php

select exists(select * from `post_user_participations` where `post_user_participations`.`post_id` = 2 and `post_user_participations`.`post_id` is not null and (`user_id` is null and `role` = 0)) as `exists`
---
    public function is_this_role_checked_by_auth_user($role)
    {
        $id = Auth::id();

        // userParticipations() にカッコを付けないとエラーになる
        return $this->userParticipations()->where(['user_id' => $id, 'role' => $role])->exists();

select exists(select * from `post_user_participations` where `post_user_participations`.`post_id` = 1 and `post_user_participations`.`post_id` is not null and (`user_id` = 2)) as `exists`
---
    public function is_this_post_checked_by_auth_user()
    {
        $id = Auth::id();
        return $this->userParticipations()->where(['user_id' => $id])->exists();

select * from `posts` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `posts`
---
    public function getPaginateByLimit (int $limit_count = 20)
    {
        return $this->orderBy('created_at', 'DESC')->paginate($limit_count);